
import { TabName } from './types';

export const EXCEL_STRUCTURE: Record<TabName, string[]> = {
  成员: ['成员ID', '成员昵称'],
  机构: ['机构ID', '机构名称', '机构类型', '国家地区', '币种', '代表色HEX'],
  手机: ['设备ID', '设备昵称', '成员昵称', '运营商', '设备类型', '国家地区', '地区号', '手机号'],
  账户: ['账户ID', '账户昵称', '成员ID', '成员昵称', '机构ID', '机构名称', '账户类型', '资产类型', '风险评估', '收益等级', '账号', '密码', '设备ID', '设备昵称', '账户细节', '登录备注'],
  保险: ['保险ID', '保险昵称', '账户ID', '账户昵称', '保险类型', '保单号', '被保险人ID', '被保险人', '受益人ID', '受益人', '保额', '备注'],
  汇率: ['汇率ID', '时间', '基准币种', '报价币种', '汇率', '来源'],
  固定资产: ['资产ID', '资产昵称', '成员ID', '成员昵称', '固定资产类型', '购入时间', '购入价格', '币种', '股份', '备注'],
  流动资产记录: ['账户ID', '账户昵称', '时间', '币种', '市值', '市值备注'],
  固定资产记录: ['资产ID', '资产昵称', '时间', '币种', '估值', '估值备注'],
  借入借出记录: ['成员ID', '成员昵称', '借入借出', '资产类型', '时间', '币种', '借款额', '借款对象', '结清', '借款备注'],
  企业分红记录: ['资产ID', '资产昵称', '账户ID', '账户昵称', '时间', '公司总分红', '币种', '股份', '分红金额', '分红备注'],
};

export const INITIAL_APP_DATA: any = Object.keys(EXCEL_STRUCTURE).reduce((acc, key) => {
  acc[key] = [];
  return acc;
}, {} as any);

export const BASE_CURRENCIES = ['USD', 'CNY', 'HKD', 'EUR', 'JPY', 'GBP'];
